create table students(StudentId int, FirstName varchar(256), LastName varchar(256), Grup int);
create table exams(StudentId int, ExamName varchar(256) , Result int);

insert into students(StudentId,FirstName, LastName,grup) values 
(1,'Петр','Алексеев',1),
(2,'Петр','Петров',1),
(3,'Алексей','Алексеев',1),
(4,'Дмитрий','Дмитриеев',1),
(5,'Афанасий','Афанасьев',1),
(6,'Полина','Полиграфова',1),
(7,'Евальд','Алексеев',1),
(8,'Еван','Петров',1),
(9,'Алекс','Алексеев',1),
(10,'Евгений-николай','Дмитриеев',1),
(11,'Афанасий','Афанасьев',1),
(12,'Полина','Полиграфова',2),
(13,'Петр','Алексеев',1),
(14,'Петр','Петров',2),
(15,'Алексей','Алексеев',1),
(16,'Дмитрий','Дмитриеев',2),
(17,'Афанасий','Афанасьев',1),
(18,'Полина','Полиграфова',2),
(19,'Петр','Алексеев',1),
(20,'Петр','Петров',2),
(21,'Алексей','Алексеев',1),
(22,'Дмитрий','Дмитриеев',2),
(23,'Афанасий','Афанасьев',1),
(24,'Полина','Полиграфова',2);

insert into exams(StudentId,ExamName,Result) values 
(1,'математика',2),
(2,'математика',2),
(3,'математика',2),
(4,'математика',2),
(5,'математика',2),
(6,'математика',2),
(7,'математика',2),
(8,'математика',2),
(9,'математика',2),
(10,'математика',2),
(11,'математика',2),
(12,'математика',3),
(13,'математика',3),
(14,'математика',5),
(15,'математика',5),
(16,'математика',2),
(17,'математика',3),
(18,'математика',4),
(19,'математика',5),
(20,'математика',3),
(21,'математика',3),
(22,'математика',5),
(23,'математика',3),
(24,'математика',5),
(1,'физика',2),
(2,'физика',2),
(3,'физика',2),
(4,'физика',2),
(5,'физика',2),
(6,'физика',2),
(7,'физика',2),
(8,'физика',2),
(9,'физика',2),
(10,'физика',2),
(11,'физика',2),
(12,'физика',3),
(13,'физика',3),
(14,'физика',5),
(15,'физика',2),
(16,'физика',2),
(17,'физика',4),
(18,'физика',5),
(19,'физика',3),
(20,'физика',3),
(21,'физика',5),
(22,'физика',2),
(23,'физика',2),
(24,'физика',4),
(1,'химия',2),
(2,'химия',2),
(3,'химия',4),
(4,'химия',5),
(5,'химия',3),
(6,'химия',2),
(7,'химия',2),
(8,'химия',2),
(9,'химия',2),
(10,'химия',4),
(11,'химия',5),
(12,'химия',3),
(13,'химия',2),
(14,'химия',2),
(15,'химия',2),
(16,'химия',2),
(17,'химия',4),
(18,'химия',5),
(19,'химия',3),
(20,'химия',2),
(21,'химия',2),
(22,'химия',2),
(23,'химия',2),
(24,'химия',4);



--Задание:а
SELECT Students.FirstName, Students.LastName 
FROM Students INNER JOIN Exams 
ON Students.StudentId = Exams.StudentId
WHERE Exams.Result < 3
GROUP BY Students.FirstName, Students.LastName, Students.StudentId HAVING count(Students.StudentId) >= 2;


--Задание:б
SELECT SUM(grup),grup FROM  (SELECT Students.FirstName, Students.LastName,Students.grup
FROM Students INNER JOIN Exams 
ON Students.StudentId = Exams.StudentId
WHERE Exams.Result < 3
GROUP BY Students.grup,Students.FirstName, Students.LastName, Students.StudentId HAVING count( Students.StudentId) >= 2) as  t

GROUP BY t.grup HAVING SUM(grup)>= 10;